*** crates/domain/src/budget.rs:40:13: delete field tokens from struct Self expression in Usage::add_tokens

*** mutation diff:
--- crates/domain/src/budget.rs
+++ delete field tokens from struct Self expression in Usage::add_tokens
@@ -32,17 +32,17 @@
     pub wall_clock: Duration,
     pub attempts: u32,
 }
 
 impl Usage {
     #[must_use]
     pub fn add_tokens(self, n: u64) -> Self {
         Self {
-            tokens: self.tokens.saturating_add(n),
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 
     #[must_use]
     pub fn add_wall_clock(self, d: Duration) -> Self {
         Self {
             wall_clock: Duration::from_seconds(

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2229794) panicked at crates/domain/src/task_tests.rs:64:5:
assertion `left == right` failed
  left: 0
 right: 1000

failures:
    task::tests::happy_path

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
