*** crates/domain/src/budget.rs:47:9: replace Usage::add_wall_clock -> Self with Default::default()

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace Usage::add_wall_clock -> Self with Default::default()
@@ -39,22 +39,17 @@
         Self {
             tokens: self.tokens.saturating_add(n),
             ..self
         }
     }
 
     #[must_use]
     pub fn add_wall_clock(self, d: Duration) -> Self {
-        Self {
-            wall_clock: Duration::from_seconds(
-                self.wall_clock.seconds().saturating_add(d.seconds()),
-            ),
-            ..self
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn add_attempt(self) -> Self {
         Self {
             attempts: self.attempts.saturating_add(1),
             ..self
         }

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2229929) panicked at crates/domain/src/task_tests.rs:64:5:
assertion `left == right` failed
  left: 0
 right: 1000

---- task::tests::verify_failure_reopens_then_escalates stdout ----

thread 'task::tests::verify_failure_reopens_then_escalates' (2229939) panicked at crates/domain/src/task_tests.rs:112:5:
assertion failed: matches!(tr.task.state, TaskState::Incident
    {
        reason: IncidentReason::Budget
        { exceeded: BudgetExceeded::Attempts { used: 2, limit: 2 } }
    })

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2229937) panicked at crates/domain/src/task_tests.rs:183:5:
attempts budget was 2

failures:
    task::tests::happy_path
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
