*** crates/domain/src/budget.rs:57:9: replace Usage::add_attempt -> Self with Default::default()

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace Usage::add_attempt -> Self with Default::default()
@@ -49,20 +49,17 @@
                 self.wall_clock.seconds().saturating_add(d.seconds()),
             ),
             ..self
         }
     }
 
     #[must_use]
     pub fn add_attempt(self) -> Self {
-        Self {
-            attempts: self.attempts.saturating_add(1),
-            ..self
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Which limit was blown. Reported on the incident bead.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, thiserror::Error)]
 #[cfg_attr(feature = "serde", derive(serde::Serialize, serde::Deserialize))]
 #[cfg_attr(feature = "serde", serde(rename_all = "snake_case"))]
 pub enum BudgetExceeded {

---- task::tests::verify_failure_reopens_then_escalates stdout ----

thread 'task::tests::verify_failure_reopens_then_escalates' (2271660) panicked at crates/domain/src/task_tests.rs:96:5:
assertion `left == right` failed
  left: 0
 right: 1

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2271655) panicked at crates/domain/src/task_tests.rs:247:5:
assertion `left == right` failed
  left: 0
 right: 1

---- task::tests::verify_failure_and_merge_failure_accumulate_usage stdout ----

thread 'task::tests::verify_failure_and_merge_failure_accumulate_usage' (2271659) panicked at crates/domain/src/task_tests.rs:192:5:
assertion `left == right` failed
  left: Usage { tokens: 0, wall_clock: Duration(0), attempts: 0 }
 right: Usage { tokens: 1000, wall_clock: Duration(20), attempts: 1 }

failures:
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_and_merge_failure_accumulate_usage
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
