*** crates/domain/src/budget.rs:58:13: delete field attempts from struct Self expression in Usage::add_attempt

*** mutation diff:
--- crates/domain/src/budget.rs
+++ delete field attempts from struct Self expression in Usage::add_attempt
@@ -50,17 +50,17 @@
             ),
             ..self
         }
     }
 
     #[must_use]
     pub fn add_attempt(self) -> Self {
         Self {
-            attempts: self.attempts.saturating_add(1),
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 }
 
 /// Which limit was blown. Reported on the incident bead.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, thiserror::Error)]
 #[cfg_attr(feature = "serde", derive(serde::Serialize, serde::Deserialize))]

---- task::tests::verify_failure_reopens_then_escalates stdout ----

thread 'task::tests::verify_failure_reopens_then_escalates' (2273404) panicked at crates/domain/src/task_tests.rs:96:5:
assertion `left == right` failed
  left: 0
 right: 1

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2273400) panicked at crates/domain/src/task_tests.rs:247:5:
assertion `left == right` failed
  left: 0
 right: 1

---- task::tests::verify_failure_and_merge_failure_accumulate_usage stdout ----

thread 'task::tests::verify_failure_and_merge_failure_accumulate_usage' (2273403) panicked at crates/domain/src/task_tests.rs:192:5:
assertion `left == right` failed
  left: Usage { tokens: 1000, wall_clock: Duration(20), attempts: 0 }
 right: Usage { tokens: 1000, wall_clock: Duration(20), attempts: 1 }

failures:
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_and_merge_failure_accumulate_usage
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
