*** crates/domain/src/budget.rs:84:9: replace Budget::check -> Result<(), BudgetExceeded> with Ok(())

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace Budget::check -> Result<(), BudgetExceeded> with Ok(())
@@ -76,35 +76,17 @@
 
 impl Budget {
     /// `Ok(())` while `usage` is within limits; the first exceeded limit otherwise
     /// (attempts checked first, since it's the one that means "the model keeps failing").
     ///
     /// # Errors
     /// Returns the exceeded limit.
     pub fn check(self, usage: Usage) -> Result<(), BudgetExceeded> {
-        if usage.attempts >= self.attempts {
-            return Err(BudgetExceeded::Attempts {
-                used: usage.attempts,
-                limit: self.attempts,
-            });
-        }
-        if usage.tokens > self.tokens {
-            return Err(BudgetExceeded::Tokens {
-                used: usage.tokens,
-                limit: self.tokens,
-            });
-        }
-        if usage.wall_clock > self.wall_clock {
-            return Err(BudgetExceeded::WallClock {
-                used: usage.wall_clock.seconds(),
-                limit: self.wall_clock.seconds(),
-            });
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2274085) panicked at crates/domain/src/budget.rs:124:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(Tokens { used: 11, limit: 10 })

---- budget::tests::attempts_take_precedence stdout ----

thread 'budget::tests::attempts_take_precedence' (2274083) panicked at crates/domain/src/budget.rs:105:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(Attempts { used: 1, limit: 1 })

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2274113) panicked at crates/domain/src/task_tests.rs:256:5:
attempts budget was 2

failures:
    budget::tests::attempts_take_precedence
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
