*** crates/domain/src/budget.rs:96:29: replace > with == in Budget::check

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace > with == in Budget::check
@@ -88,17 +88,17 @@
             });
         }
         if usage.tokens > self.tokens {
             return Err(BudgetExceeded::Tokens {
                 used: usage.tokens,
                 limit: self.tokens,
             });
         }
-        if usage.wall_clock > self.wall_clock {
+        if usage.wall_clock == /* ~ changed by cargo-mutants ~ */ self.wall_clock {
             return Err(BudgetExceeded::WallClock {
                 used: usage.wall_clock.seconds(),
                 limit: self.wall_clock.seconds(),
             });
         }
         Ok(())
     }
 }

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2278016) panicked at crates/domain/src/budget.rs:141:9:
assertion `left == right` failed: exactly at the limit is fine
  left: Err(WallClock { used: 10, limit: 10 })
 right: Ok(())

failures:
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
