*** crates/domain/src/budget.rs:96:29: replace > with < in Budget::check

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace > with < in Budget::check
@@ -88,17 +88,17 @@
             });
         }
         if usage.tokens > self.tokens {
             return Err(BudgetExceeded::Tokens {
                 used: usage.tokens,
                 limit: self.tokens,
             });
         }
-        if usage.wall_clock > self.wall_clock {
+        if usage.wall_clock < /* ~ changed by cargo-mutants ~ */ self.wall_clock {
             return Err(BudgetExceeded::WallClock {
                 used: usage.wall_clock.seconds(),
                 limit: self.wall_clock.seconds(),
             });
         }
         Ok(())
     }
 }

---- budget::tests::within_budget_is_ok stdout ----

thread 'budget::tests::within_budget_is_ok' (2278057) panicked at crates/domain/src/budget.rs:161:9:
assertion `left == right` failed
  left: Err(WallClock { used: 0, limit: 2700 })
 right: Ok(())

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2278056) panicked at crates/domain/src/budget.rs:149:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(WallClock { used: 11, limit: 10 })

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2278084) panicked at crates/domain/src/task_tests.rs:246:5:
assertion `left == right` failed
  left: Incident { reason: Budget { exceeded: WallClock { used: 5, limit: 2700 } } }
 right: Open

failures:
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock
    budget::tests::within_budget_is_ok
    task::tests::merge_failure_reopens_with_note
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 34 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
