*** crates/domain/src/lease.rs:27:13: replace >= with < in Lease::is_expired

*** mutation diff:
--- crates/domain/src/lease.rs
+++ replace >= with < in Lease::is_expired
@@ -19,17 +19,17 @@
             holder,
             claimed_at: now,
             expires: now + ttl,
         }
     }
 
     #[must_use]
     pub fn is_expired(&self, now: Timestamp) -> bool {
-        now >= self.expires
+        now < /* ~ changed by cargo-mutants ~ */ self.expires
     }
 
     /// Extend the lease from `now` (not from the old expiry) so a stalled heartbeat
     /// cannot accumulate credit.
     #[must_use]
     pub fn renew(self, now: Timestamp, ttl: Duration) -> Self {
         Self {
             expires: now + ttl,

---- lease::tests::expires_at_boundary stdout ----

thread 'lease::tests::expires_at_boundary' (2282183) panicked at crates/domain/src/lease.rs:56:9:
assertion failed: !l.is_expired(Timestamp::from_unix_seconds(9))

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2282199) panicked at crates/domain/src/task_tests.rs:226:62:

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2282200) panicked at crates/domain/src/task_tests.rs:134:14:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "leased", event: "lease_expired" }

failures:
    lease::tests::expires_at_boundary
    task::tests::happy_path
    task::tests::heartbeat_after_expiry_is_rejected
    task::tests::lease_expiry_before_expiry_is_illegal
    task::tests::lease_expiry_reopens_and_storms
    task::tests::lease_expiry_updates_usage_and_counter

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
