*** crates/domain/src/lease.rs:27:9: replace Lease::is_expired -> bool with true

*** mutation diff:
--- crates/domain/src/lease.rs
+++ replace Lease::is_expired -> bool with true
@@ -19,17 +19,17 @@
             holder,
             claimed_at: now,
             expires: now + ttl,
         }
     }
 
     #[must_use]
     pub fn is_expired(&self, now: Timestamp) -> bool {
-        now >= self.expires
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Extend the lease from `now` (not from the old expiry) so a stalled heartbeat
     /// cannot accumulate credit.
     #[must_use]
     pub fn renew(self, now: Timestamp, ttl: Duration) -> Self {
         Self {
             expires: now + ttl,

---- lease::tests::expires_at_boundary stdout ----

thread 'lease::tests::expires_at_boundary' (2282126) panicked at crates/domain/src/lease.rs:56:9:
assertion failed: !l.is_expired(Timestamp::from_unix_seconds(9))

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2282139) panicked at crates/domain/src/task_tests.rs:61:10:
called `Result::unwrap()` on an `Err` value: LeaseExpired { id: BeadId("fac-1"), expires: Timestamp(60) }

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2282142) panicked at crates/domain/src/task_tests.rs:226:62:

failures:
    lease::tests::expires_at_boundary
    task::tests::happy_path
    task::tests::lease_expiry_before_expiry_is_illegal

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
