*** crates/domain/src/meta.rs:142:5: replace default_timeout -> crate::time::Duration with Default::default()

*** mutation diff:
--- crates/domain/src/meta.rs
+++ replace default_timeout -> crate::time::Duration with Default::default()
@@ -134,17 +134,17 @@
     pub version: u32,
     pub task: String,
     pub commands: Vec<String>,
     #[cfg_attr(feature = "serde", serde(default = "default_timeout"))]
     pub timeout: crate::time::Duration,
 }
 
 fn default_timeout() -> crate::time::Duration {
-    crate::time::Duration::from_minutes(20)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Why a verify blob could not be decoded.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum VerifyMetaParseError {
     #[error("unsupported verify metadata version {found} (expected {expected})")]
     Version { found: u32, expected: u32 },
     #[error("invalid task id: {0}")]

---- meta::tests::verify_meta_rejects_empty_commands stdout ----

thread 'meta::tests::verify_meta_rejects_empty_commands' (2283587) panicked at crates/domain/src/meta.rs:337:9:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(1200)

failures:
    meta::tests::verify_meta_rejects_empty_commands

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
