*** crates/domain/src/meta.rs:160:24: replace != with == in <impl TryFrom<RawVerifyMeta> for VerifyMeta>::try_from

*** mutation diff:
--- crates/domain/src/meta.rs
+++ replace != with == in <impl TryFrom<RawVerifyMeta> for VerifyMeta>::try_from
@@ -152,17 +152,17 @@
     #[error("verify bead has no commands")]
     NoCommands,
 }
 
 impl TryFrom<RawVerifyMeta> for VerifyMeta {
     type Error = VerifyMetaParseError;
 
     fn try_from(raw: RawVerifyMeta) -> Result<Self, Self::Error> {
-        if raw.version != META_VERSION {
+        if raw.version == /* ~ changed by cargo-mutants ~ */ META_VERSION {
             return Err(VerifyMetaParseError::Version {
                 found: raw.version,
                 expected: META_VERSION,
             });
         }
         if raw.commands.iter().all(|c| c.trim().is_empty()) {
             return Err(VerifyMetaParseError::NoCommands);
         }

---- meta::tests::verify_and_merge_meta_reject_bad_versions_and_ids stdout ----

thread 'meta::tests::verify_and_merge_meta_reject_bad_versions_and_ids' (2284356) panicked at crates/domain/src/meta.rs:354:9:
assertion failed: serde_json::from_str::<VerifyMeta>(r#"{"version":9,"task":"fac-1","commands":["x"]}"#).is_err()

---- meta::tests::verify_meta_rejects_empty_commands stdout ----

thread 'meta::tests::verify_meta_rejects_empty_commands' (2284357) panicked at crates/domain/src/meta.rs:336:54:
called `Result::unwrap()` on an `Err` value: Error("unsupported verify metadata version 1 (expected 1)", line: 0, column: 0)

failures:
    meta::tests::verify_and_merge_meta_reject_bad_versions_and_ids
    meta::tests::verify_meta_rejects_empty_commands

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
