*** crates/domain/src/meta.rs:68:24: replace != with == in <impl TryFrom<RawFactoryMeta> for FactoryMeta>::try_from

*** mutation diff:
--- crates/domain/src/meta.rs
+++ replace != with == in <impl TryFrom<RawFactoryMeta> for FactoryMeta>::try_from
@@ -60,17 +60,17 @@
     #[error("invalid base sha: {0}")]
     Base(String),
 }
 
 impl TryFrom<RawFactoryMeta> for FactoryMeta {
     type Error = MetaParseError;
 
     fn try_from(raw: RawFactoryMeta) -> Result<Self, Self::Error> {
-        if raw.version != META_VERSION {
+        if raw.version == /* ~ changed by cargo-mutants ~ */ META_VERSION {
             return Err(MetaParseError::Version {
                 found: raw.version,
                 expected: META_VERSION,
             });
         }
         Ok(Self {
             verify_bead: BeadId::try_new(raw.verify_bead)
                 .map_err(|e| MetaParseError::VerifyBead(e.to_string()))?,

---- meta::tests::missing_budget_defaults stdout ----

thread 'meta::tests::missing_budget_defaults' (2283499) panicked at crates/domain/src/meta.rs:414:54:
called `Result::unwrap()` on an `Err` value: Error("unsupported factory metadata version 1 (expected 1)", line: 0, column: 0)

---- meta::tests::rejects_bad_version_and_sha stdout ----

thread 'meta::tests::rejects_bad_version_and_sha' (2283500) panicked at crates/domain/src/meta.rs:325:60:

---- meta::tests::json_roundtrip_leased stdout ----

thread 'meta::tests::json_roundtrip_leased' (2283497) panicked at crates/domain/src/meta.rs:318:61:
called `Result::unwrap()` on an `Err` value: Error("unsupported factory metadata version 1 (expected 1)", line: 0, column: 0)

failures:
    meta::tests::json_roundtrip_leased
    meta::tests::missing_budget_defaults
    meta::tests::rejects_bad_version_and_sha

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
