*** crates/domain/src/plan.rs:156:50: delete ! in RawPlan::validate

*** mutation diff:
--- crates/domain/src/plan.rs
+++ delete ! in RawPlan::validate
@@ -148,17 +148,17 @@
                     task: t.key.to_string(),
                     needs: n.to_string(),
                 });
             }
         }
         let tasks = topo_sort(tasks)?;
         Ok(Plan {
             summary: self.summary,
-            reference: self.reference.filter(|r| !r.trim().is_empty()),
+            reference: self.reference.filter(|r|  /* ~ changed by cargo-mutants ~ */r.trim().is_empty()),
             tasks,
         })
     }
 }
 
 /// Per-task defaults the Planner doesn't set.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct PlanDefaults {

---- plan::tests::blank_reference_is_none_and_keys_display stdout ----

thread 'plan::tests::blank_reference_is_none_and_keys_display' (2288584) panicked at crates/domain/src/plan.rs:258:9:
assertion `left == right` failed
  left: Some("   ")
 right: None

failures:
    plan::tests::blank_reference_is_none_and_keys_display

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
