*** crates/domain/src/plan.rs:183:53: replace == with != in parse_key

*** mutation diff:
--- crates/domain/src/plan.rs
+++ replace == with != in parse_key
@@ -175,17 +175,17 @@
     }
 }
 
 fn parse_key(s: &str) -> Result<TaskKey, PlanError> {
     let t = s.trim();
     if t.is_empty()
         || !t
             .chars()
-            .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+            .all(|c| c.is_ascii_alphanumeric() || c != /* ~ changed by cargo-mutants ~ */ '-' || c == '_')
     {
         return Err(PlanError::BadKey(s.to_owned()));
     }
     Ok(TaskKey(t.to_owned()))
 }
 
 /// Kahn's algorithm; stable with respect to input order among ready tasks.
 fn topo_sort(tasks: Vec<PlannedTask>) -> Result<Vec<PlannedTask>, PlanError> {

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2245029) panicked at crates/domain/src/plan.rs:279:9:
assertion failed: matches!(plan(vec![raw("bad key", &[])]).validate(d),
    Err(PlanError::BadKey(_)))

failures:
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
