*** crates/domain/src/plan.rs:192:5: replace topo_sort -> Result<Vec<PlannedTask>, PlanError> with Ok(vec![])

*** mutation diff:
--- crates/domain/src/plan.rs
+++ replace topo_sort -> Result<Vec<PlannedTask>, PlanError> with Ok(vec![])
@@ -184,44 +184,17 @@
     {
         return Err(PlanError::BadKey(s.to_owned()));
     }
     Ok(TaskKey(t.to_owned()))
 }
 
 /// Kahn's algorithm; stable with respect to input order among ready tasks.
 fn topo_sort(tasks: Vec<PlannedTask>) -> Result<Vec<PlannedTask>, PlanError> {
-    let mut indegree: BTreeMap<TaskKey, usize> = tasks
-        .iter()
-        .map(|t| (t.key.clone(), t.needs.len()))
-        .collect();
-    let mut pending: Vec<PlannedTask> = tasks;
-    let mut ordered = Vec::with_capacity(pending.len());
-    while !pending.is_empty() {
-        let Some(pos) = pending
-            .iter()
-            .position(|t| indegree.get(&t.key).copied() == Some(0))
-        else {
-            let stuck = pending
-                .first()
-                .map(|t| t.key.to_string())
-                .unwrap_or_default();
-            return Err(PlanError::Cycle(stuck));
-        };
-        let done = pending.remove(pos);
-        for t in &pending {
-            if t.needs.contains(&done.key)
-                && let Some(d) = indegree.get_mut(&t.key)
-            {
-                *d = d.saturating_sub(1);
-            }
-        }
-        ordered.push(done);
-    }
-    Ok(ordered)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn raw(key: &str, needs: &[&str]) -> RawPlannedTask {
         RawPlannedTask {

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2245293) panicked at crates/domain/src/plan.rs:229:9:
assertion failed: matches!(plan(vec![raw("a", &["b"]), raw("b", &["a"])]).validate(d),
    Err(PlanError::Cycle(_)))

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2245292) panicked at crates/domain/src/plan.rs:223:9:
assertion `left == right` failed
  left: []
 right: ["a", "b", "c"]

failures:
    plan::tests::orders_needs_first
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
