*** crates/domain/src/plan.rs:25:9: replace <impl core::fmt::Display for TaskKey>::fmt -> core::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/domain/src/plan.rs
+++ replace <impl core::fmt::Display for TaskKey>::fmt -> core::fmt::Result with Ok(Default::default())
@@ -17,17 +17,17 @@
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }
 
 impl core::fmt::Display for TaskKey {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
-        f.write_str(&self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One planned task, validated.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct PlannedTask {
     pub key: TaskKey,
     pub title: String,

---- plan::tests::blank_reference_is_none_and_keys_display stdout ----

thread 'plan::tests::blank_reference_is_none_and_keys_display' (2286954) panicked at crates/domain/src/plan.rs:259:9:
assertion `left == right` failed
  left: ""
 right: "a"

failures:
    plan::tests::blank_reference_is_none_and_keys_display

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
