*** crates/domain/src/task.rs:175:9: replace TaskState::name -> &'static str with ""

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace TaskState::name -> &'static str with ""
@@ -167,24 +167,17 @@
     },
     #[error("task {id}: lease already expired at {expires}")]
     LeaseExpired { id: BeadId, expires: Timestamp },
 }
 
 impl TaskState {
     #[must_use]
     pub const fn name(&self) -> &'static str {
-        match self {
-            Self::Open => "open",
-            Self::Leased { .. } => "leased",
-            Self::InVerify { .. } => "in_verify",
-            Self::Mergeable { .. } => "mergeable",
-            Self::Closed { .. } => "closed",
-            Self::Incident { .. } => "incident",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_terminal(&self) -> bool {
         match self {
             Self::Closed { .. } | Self::Incident { .. } => true,
             Self::Open | Self::Leased { .. } | Self::InVerify { .. } | Self::Mergeable { .. } => {
                 false

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2247012) panicked at crates/domain/src/task_tests.rs:54:5:
assertion `left == right` failed
  left: ""
 right: "leased"

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2247015) panicked at crates/domain/src/task_tests.rs:154:5:
assertion failed: matches!(err, IllegalTransition::NotAllowed
    { state: "leased", event: "lease_expired", .. })

failures:
    task::tests::happy_path
    task::tests::lease_expiry_before_expiry_is_illegal

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
