*** crates/domain/src/task.rs:187:9: replace TaskState::is_terminal -> bool with true

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace TaskState::is_terminal -> bool with true
@@ -179,22 +179,17 @@
             Self::Mergeable { .. } => "mergeable",
             Self::Closed { .. } => "closed",
             Self::Incident { .. } => "incident",
         }
     }
 
     #[must_use]
     pub const fn is_terminal(&self) -> bool {
-        match self {
-            Self::Closed { .. } | Self::Incident { .. } => true,
-            Self::Open | Self::Leased { .. } | Self::InVerify { .. } | Self::Mergeable { .. } => {
-                false
-            }
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Event {
     #[must_use]
     pub const fn name(&self) -> &'static str {
         match self {
             Self::Claim { .. } => "claim",

---- task::tests::terminal_flags_and_state_names stdout ----

thread 'task::tests::terminal_flags_and_state_names' (2294273) panicked at crates/domain/src/task_tests.rs:152:5:
assertion failed: !TaskState::Open.is_terminal()

failures:
    task::tests::terminal_flags_and_state_names

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
