*** crates/domain/src/task.rs:269:25: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -261,19 +261,17 @@
                     return Err(IllegalTransition::LeaseExpired {
                         id: self.id,
                         expires: lease.expires,
                     });
                 }
                 let ttl = lease.expires.since(lease.claimed_at);
                 Ok(Transition {
                     task: Task {
-                        state: TaskState::Leased {
-                            lease: lease.renew(now, ttl),
-                        },
+                         /* ~ changed by cargo-mutants ~ */
                         ..self
                     },
                     effects: vec![],
                 })
             }
             (
                 TaskState::Leased { lease },
                 Event::Submit {

*** result: Success
