*** crates/domain/src/task.rs:302:20: delete ! in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete ! in Task::apply
@@ -294,17 +294,17 @@
                         usage,
                         state: TaskState::InVerify { branch, head },
                         ..self
                     },
                     effects: vec![],
                 })
             }
             (TaskState::Leased { lease }, Event::LeaseExpired { now }) => {
-                if !lease.is_expired(now) {
+                if  /* ~ changed by cargo-mutants ~ */lease.is_expired(now) {
                     return Err(illegal(&self.state, &Event::LeaseExpired { now }));
                 }
                 let expiries = self.lease_expiries.saturating_add(1);
                 let usage = self.usage.add_wall_clock(now.since(lease.claimed_at));
                 let note = format!(
                     "lease held by {} expired at {}",
                     lease.holder,
                     now.unix_seconds()

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2250545) panicked at crates/domain/src/task_tests.rs:134:14:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "leased", event: "lease_expired" }

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2250544) panicked at crates/domain/src/task_tests.rs:153:62:

failures:
    task::tests::lease_expiry_before_expiry_is_illegal
    task::tests::lease_expiry_reopens_and_storms

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
