*** crates/domain/src/task.rs:312:29: replace >= with < in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace >= with < in Task::apply
@@ -304,17 +304,17 @@
                 }
                 let expiries = self.lease_expiries.saturating_add(1);
                 let usage = self.usage.add_wall_clock(now.since(lease.claimed_at));
                 let note = format!(
                     "lease held by {} expired at {}",
                     lease.holder,
                     now.unix_seconds()
                 );
-                if expiries >= MAX_LEASE_EXPIRIES {
+                if expiries < /* ~ changed by cargo-mutants ~ */ MAX_LEASE_EXPIRIES {
                     let t = Task {
                         usage,
                         lease_expiries: expiries,
                         ..self
                     };
                     return Ok(t.escalate(IncidentReason::LeaseStorm { expiries }));
                 }
                 Ok(Transition {

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2251954) panicked at crates/domain/src/task_tests.rs:135:9:
assertion `left == right` failed
  left: Incident { reason: LeaseStorm { expiries: 1 } }
 right: Open

failures:
    task::tests::lease_expiry_reopens_and_storms

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
