*** crates/domain/src/task.rs:314:25: delete field usage from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field usage from struct Task expression in Task::apply
@@ -306,17 +306,17 @@
                 let usage = self.usage.add_wall_clock(now.since(lease.claimed_at));
                 let note = format!(
                     "lease held by {} expired at {}",
                     lease.holder,
                     now.unix_seconds()
                 );
                 if expiries >= MAX_LEASE_EXPIRIES {
                     let t = Task {
-                        usage,
+                         /* ~ changed by cargo-mutants ~ */
                         lease_expiries: expiries,
                         ..self
                     };
                     return Ok(t.escalate(IncidentReason::LeaseStorm { expiries }));
                 }
                 Ok(Transition {
                     task: Task {
                         usage,

*** result: Success
