*** crates/domain/src/task.rs:324:25: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -316,17 +316,17 @@
                         ..self
                     };
                     return Ok(t.escalate(IncidentReason::LeaseStorm { expiries }));
                 }
                 Ok(Transition {
                     task: Task {
                         usage,
                         lease_expiries: expiries,
-                        state: TaskState::Open,
+                         /* ~ changed by cargo-mutants ~ */
                         ..self
                     },
                     effects: vec![Effect::AppendNote { task: id, note }],
                 })
             }
 
             // ---- in_verify ------------------------------------------------------------
             (TaskState::InVerify { branch, head }, Event::VerifyPassed) => Ok(Transition {

---- task::tests::lease_expiry_updates_usage_and_counter stdout ----

thread 'task::tests::lease_expiry_updates_usage_and_counter' (2301034) panicked at crates/domain/src/task_tests.rs:173:5:
assertion `left == right` failed
  left: Leased { lease: Lease { holder: AgentId("w1"), claimed_at: Timestamp(0), expires: Timestamp(60) } }
 right: Open

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2301033) panicked at crates/domain/src/task_tests.rs:135:9:
assertion `left == right` failed
  left: Leased { lease: Lease { holder: AgentId("w1"), claimed_at: Timestamp(0), expires: Timestamp(60) } }
 right: Open

failures:
    task::tests::lease_expiry_reopens_and_storms
    task::tests::lease_expiry_updates_usage_and_counter

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
