*** crates/domain/src/task.rs:334:21: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -326,20 +326,17 @@
                     },
                     effects: vec![Effect::AppendNote { task: id, note }],
                 })
             }
 
             // ---- in_verify ------------------------------------------------------------
             (TaskState::InVerify { branch, head }, Event::VerifyPassed) => Ok(Transition {
                 task: Task {
-                    state: TaskState::Mergeable {
-                        branch: branch.clone(),
-                        head: head.clone(),
-                    },
+                     /* ~ changed by cargo-mutants ~ */
                     ..self
                 },
                 effects: vec![Effect::OpenMergeBead {
                     task: id,
                     branch,
                     head,
                 }],
             }),

---- task::tests::merge_failure_reopens_with_note stdout ----

thread 'task::tests::merge_failure_reopens_with_note' (2301197) panicked at crates/domain/src/task_tests.rs:314:10:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "in_verify", event: "merge_failed" }

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2301191) panicked at crates/domain/src/task_tests.rs:67:5:
assertion `left == right` failed
  left: "in_verify"
 right: "mergeable"

---- task::tests::verify_failure_and_merge_failure_accumulate_usage stdout ----

thread 'task::tests::verify_failure_and_merge_failure_accumulate_usage' (2301201) panicked at crates/domain/src/task_tests.rs:218:10:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "in_verify", event: "merge_failed" }

failures:
    task::tests::happy_path
    task::tests::illegal_pairs_in_active_states
    task::tests::merge_failure_reopens_with_note
    task::tests::verify_failure_and_merge_failure_accumulate_usage

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
