*** crates/domain/src/task.rs:370:25: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -362,17 +362,17 @@
                 }
             }
 
             // ---- mergeable ------------------------------------------------------------
             (TaskState::Mergeable { .. }, Event::Merged { merged }) => {
                 let verify = self.verify_bead.clone();
                 Ok(Transition {
                     task: Task {
-                        state: TaskState::Closed { merged },
+                         /* ~ changed by cargo-mutants ~ */
                         ..self
                     },
                     effects: vec![
                         Effect::CloseTaskBead { task: id },
                         Effect::CloseVerifyBead { verify },
                     ],
                 })
             }

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2255285) panicked at crates/domain/src/task_tests.rs:73:5:
assertion `left == right` failed
  left: "mergeable"
 right: "closed"

failures:
    task::tests::happy_path

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
