*** crates/domain/src/task.rs:407:29: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -399,17 +399,17 @@
                 let usage = self
                     .usage
                     .add_wall_clock(now.since(lease.claimed_at))
                     .add_attempt();
                 let t = Task { usage, ..self };
                 match t.budget.check(usage) {
                     Ok(()) => Ok(Transition {
                         task: Task {
-                            state: TaskState::Open,
+                             /* ~ changed by cargo-mutants ~ */
                             ..t
                         },
                         effects: vec![Effect::AppendNote { task: id, note }],
                     }),
                     Err(exceeded) => {
                         let mut tr = t.escalate(IncidentReason::Budget { exceeded });
                         tr.effects.insert(0, Effect::AppendNote { task: id, note });
                         Ok(tr)

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2256530) panicked at crates/domain/src/task_tests.rs:173:5:
assertion `left == right` failed
  left: Leased { lease: Lease { holder: AgentId("w1"), claimed_at: Timestamp(0), expires: Timestamp(60) } }
 right: Open

failures:
    task::tests::release_reopens_and_counts_attempt_then_escalates

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
