*** crates/domain/src/task.rs:503:26: replace == with != in Task::require_holder

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace == with != in Task::require_holder
@@ -495,17 +495,17 @@
         }
     }
 
     fn require_holder(
         id: &BeadId,
         lease: &Lease,
         actor: &AgentId,
     ) -> Result<(), IllegalTransition> {
-        if &lease.holder == actor {
+        if &lease.holder != /* ~ changed by cargo-mutants ~ */ actor {
             Ok(())
         } else {
             Err(IllegalTransition::NotHolder {
                 id: id.clone(),
                 actor: actor.clone(),
                 holder: lease.holder.clone(),
             })
         }

---- task::tests::heartbeat_after_expiry_is_rejected stdout ----

thread 'task::tests::heartbeat_after_expiry_is_rejected' (2305316) panicked at crates/domain/src/task_tests.rs:296:5:
assertion failed: matches!(err, IllegalTransition::LeaseExpired { .. })

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2305315) panicked at crates/domain/src/task_tests.rs:61:10:
called `Result::unwrap()` on an `Err` value: NotHolder { id: BeadId("fac-1"), actor: AgentId("w1"), holder: AgentId("w1") }

---- task::tests::escalate_from_any_active_state stdout ----

thread 'task::tests::escalate_from_any_active_state' (2305314) panicked at crates/domain/src/task_tests.rs:410:45:
called `Result::unwrap()` on an `Err` value: NotHolder { id: BeadId("fac-1"), actor: AgentId("w1"), holder: AgentId("w1") }

failures:
    task::tests::escalate_from_any_active_state
    task::tests::happy_path
    task::tests::heartbeat_after_expiry_is_rejected
    task::tests::illegal_pairs_in_active_states
    task::tests::merge_failure_reopens_with_note
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_and_merge_failure_accumulate_usage
    task::tests::verify_failure_reopens_then_escalates
    task::tests::wrong_holder_cannot_submit_or_heartbeat

test result: FAILED. 30 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
