*** crates/domain/src/task.rs:503:9: replace Task::require_holder -> Result<(), IllegalTransition> with Ok(())

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace Task::require_holder -> Result<(), IllegalTransition> with Ok(())
@@ -495,23 +495,15 @@
         }
     }
 
     fn require_holder(
         id: &BeadId,
         lease: &Lease,
         actor: &AgentId,
     ) -> Result<(), IllegalTransition> {
-        if &lease.holder == actor {
-            Ok(())
-        } else {
-            Err(IllegalTransition::NotHolder {
-                id: id.clone(),
-                actor: actor.clone(),
-                holder: lease.holder.clone(),
-            })
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[path = "task_tests.rs"]
 mod tests;

---- task::tests::wrong_holder_cannot_submit_or_heartbeat stdout ----

thread 'task::tests::wrong_holder_cannot_submit_or_heartbeat' (2257328) panicked at crates/domain/src/task_tests.rs:197:5:
assertion failed: matches!(task.clone().apply(bad), Err(IllegalTransition::NotHolder { .. }))

failures:
    task::tests::wrong_holder_cannot_submit_or_heartbeat

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
