*** crates/domain/src/time.rs:26:9: replace Timestamp::since -> Duration with Default::default()

*** mutation diff:
--- crates/domain/src/time.rs
+++ replace Timestamp::since -> Duration with Default::default()
@@ -18,17 +18,17 @@
     #[must_use]
     pub const fn unix_seconds(self) -> i64 {
         self.0
     }
 
     /// Elapsed time from `earlier` to `self`; zero if `earlier` is later.
     #[must_use]
     pub fn since(self, earlier: Self) -> Duration {
-        Duration::from_seconds(u64::try_from(self.0.saturating_sub(earlier.0)).unwrap_or(0))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Timestamp {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.0)
     }
 }

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2259153) panicked at crates/domain/src/task_tests.rs:65:5:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(50)

---- time::tests::since_is_saturating stdout ----

thread 'time::tests::since_is_saturating' (2259164) panicked at crates/domain/src/time.rs:76:9:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(60)

failures:
    task::tests::happy_path
    time::tests::since_is_saturating

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
