*** crates/domain/src/budget.rs:39:9: replace Usage::add_tokens -> Self with Default::default()

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace Usage::add_tokens -> Self with Default::default()
@@ -31,20 +31,17 @@
     pub tokens: u64,
     pub wall_clock: Duration,
     pub attempts: u32,
 }
 
 impl Usage {
     #[must_use]
     pub fn add_tokens(self, n: u64) -> Self {
-        Self {
-            tokens: self.tokens.saturating_add(n),
-            ..self
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn add_wall_clock(self, d: Duration) -> Self {
         Self {
             wall_clock: Duration::from_seconds(
                 self.wall_clock.seconds().saturating_add(d.seconds()),
             ),

---- budget::tests::check_is_monotone_in_usage stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-software-factory-rs-rD0p8w.tmp/crates/domain/proptest-regressions/budget.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc 9b58de2286a28b354ec68c6d29454deee70062253dc1321525d51b031d58ca5b

thread 'budget::tests::check_is_monotone_in_usage' (2218760) panicked at crates/domain/src/budget.rs:131:5:
Test failed: assertion failed: b.check(more).is_err() at crates/domain/src/budget.rs:138.
minimal failing input: tokens = 400001, extra = 0
	successes: 1
	local rejects: 0
	global rejects: 0

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2218779) panicked at crates/domain/src/task_tests.rs:64:5:
assertion `left == right` failed
  left: 0
 right: 1000

---- task::tests::verify_failure_reopens_then_escalates stdout ----

thread 'task::tests::verify_failure_reopens_then_escalates' (2218791) panicked at crates/domain/src/task_tests.rs:112:5:
assertion failed: matches!(tr.task.state, TaskState::Incident
    {
        reason: IncidentReason::Budget
        { exceeded: BudgetExceeded::Attempts { used: 2, limit: 2 } }
    })

failures:
    budget::tests::check_is_monotone_in_usage
    task::tests::happy_path
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
