*** crates/domain/src/budget.rs:48:13: delete field wall_clock from struct Self expression in Usage::add_wall_clock

*** mutation diff:
--- crates/domain/src/budget.rs
+++ delete field wall_clock from struct Self expression in Usage::add_wall_clock
@@ -40,19 +40,17 @@
             tokens: self.tokens.saturating_add(n),
             ..self
         }
     }
 
     #[must_use]
     pub fn add_wall_clock(self, d: Duration) -> Self {
         Self {
-            wall_clock: Duration::from_seconds(
-                self.wall_clock.seconds().saturating_add(d.seconds()),
-            ),
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 
     #[must_use]
     pub fn add_attempt(self) -> Self {
         Self {
             attempts: self.attempts.saturating_add(1),

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2277885) panicked at crates/domain/src/budget.rs:147:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(WallClock { used: 11, limit: 10 })

---- task::tests::lease_expiry_updates_usage_and_counter stdout ----

thread 'task::tests::lease_expiry_updates_usage_and_counter' (2277932) panicked at crates/domain/src/task_tests.rs:172:5:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(90)

---- task::tests::verify_failure_and_merge_failure_accumulate_usage stdout ----

thread 'task::tests::verify_failure_and_merge_failure_accumulate_usage' (2277937) panicked at crates/domain/src/task_tests.rs:187:5:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(20)

failures:
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock
    task::tests::happy_path
    task::tests::lease_expiry_updates_usage_and_counter
    task::tests::verify_failure_and_merge_failure_accumulate_usage

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
