*** crates/domain/src/budget.rs:84:27: replace >= with < in Budget::check

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace >= with < in Budget::check
@@ -76,17 +76,17 @@
 
 impl Budget {
     /// `Ok(())` while `usage` is within limits; the first exceeded limit otherwise
     /// (attempts checked first, since it's the one that means "the model keeps failing").
     ///
     /// # Errors
     /// Returns the exceeded limit.
     pub fn check(self, usage: Usage) -> Result<(), BudgetExceeded> {
-        if usage.attempts >= self.attempts {
+        if usage.attempts < /* ~ changed by cargo-mutants ~ */ self.attempts {
             return Err(BudgetExceeded::Attempts {
                 used: usage.attempts,
                 limit: self.attempts,
             });
         }
         if usage.tokens > self.tokens {
             return Err(BudgetExceeded::Tokens {
                 used: usage.tokens,

---- budget::tests::attempts_take_precedence stdout ----

thread 'budget::tests::attempts_take_precedence' (2226280) panicked at crates/domain/src/budget.rs:123:9:
assertion `left == right` failed
  left: Err(Tokens { used: 100, limit: 10 })
 right: Err(Attempts { used: 1, limit: 1 })

---- budget::tests::within_budget_is_ok stdout ----

thread 'budget::tests::within_budget_is_ok' (2226282) panicked at crates/domain/src/budget.rs:131:9:
assertion `left == right` failed
  left: Err(Attempts { used: 0, limit: 3 })
 right: Ok(())

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2226306) panicked at crates/domain/src/task_tests.rs:173:5:
assertion `left == right` failed
  left: Incident { reason: Budget { exceeded: Attempts { used: 1, limit: 2 } } }
 right: Open

failures:
    budget::tests::attempts_take_precedence
    budget::tests::within_budget_is_ok
    task::tests::merge_failure_reopens_with_note
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 27 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
