*** crates/domain/src/budget.rs:90:25: replace > with < in Budget::check

*** mutation diff:
--- crates/domain/src/budget.rs
+++ replace > with < in Budget::check
@@ -82,17 +82,17 @@
     /// Returns the exceeded limit.
     pub fn check(self, usage: Usage) -> Result<(), BudgetExceeded> {
         if usage.attempts >= self.attempts {
             return Err(BudgetExceeded::Attempts {
                 used: usage.attempts,
                 limit: self.attempts,
             });
         }
-        if usage.tokens > self.tokens {
+        if usage.tokens < /* ~ changed by cargo-mutants ~ */ self.tokens {
             return Err(BudgetExceeded::Tokens {
                 used: usage.tokens,
                 limit: self.tokens,
             });
         }
         if usage.wall_clock > self.wall_clock {
             return Err(BudgetExceeded::WallClock {
                 used: usage.wall_clock.seconds(),

---- budget::tests::within_budget_is_ok stdout ----

thread 'budget::tests::within_budget_is_ok' (2276503) panicked at crates/domain/src/budget.rs:161:9:
assertion `left == right` failed
  left: Err(Tokens { used: 0, limit: 400000 })
 right: Ok(())

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2276502) panicked at crates/domain/src/budget.rs:142:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(Tokens { used: 11, limit: 10 })

---- budget::tests::check_is_monotone_in_usage stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-software-factory-rs-ilHxKr.tmp/crates/domain/proptest-regressions/budget.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 94eb6639b0076e902d539fc3dc64c2299e19cd4da819feb3ba1c62fd94e2484f

thread 'budget::tests::check_is_monotone_in_usage' (2276501) panicked at crates/domain/src/budget.rs:164:5:
Test failed: assertion failed: b.check(more).is_err() at crates/domain/src/budget.rs:171.
minimal failing input: tokens = 0, extra = 400000
	successes: 16
	local rejects: 0
	global rejects: 0

failures:
    budget::tests::check_is_monotone_in_usage
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock
    budget::tests::within_budget_is_ok
    task::tests::merge_failure_reopens_with_note
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
