*** crates/domain/src/kind.rs:33:9: replace BeadKind::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/domain/src/kind.rs
+++ replace BeadKind::as_str -> &'static str with "xyzzy"
@@ -25,25 +25,17 @@
 }
 
 impl BeadKind {
     /// Label prefix under which the kind is stored on the bead.
     pub const LABEL_PREFIX: &'static str = "fac:kind=";
 
     #[must_use]
     pub const fn as_str(self) -> &'static str {
-        match self {
-            Self::Epic => "epic",
-            Self::Task => "task",
-            Self::Verify => "verify",
-            Self::Merge => "merge",
-            Self::Question => "question",
-            Self::Incident => "incident",
-            Self::Reference => "reference",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// The label string to attach to a bead.
     #[must_use]
     pub fn label(self) -> String {
         format!("{}{}", Self::LABEL_PREFIX, self.as_str())
     }

---- kind::tests::label_roundtrip stdout ----

thread 'kind::tests::label_roundtrip' (2279370) panicked at crates/domain/src/kind.rs:100:13:
assertion `left == right` failed
  left: None
 right: Some(Epic)

---- kind::tests::display_matches_as_str stdout ----

thread 'kind::tests::display_matches_as_str' (2279369) panicked at crates/domain/src/kind.rs:106:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "verify"

failures:
    kind::tests::display_matches_as_str
    kind::tests::label_roundtrip

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
