*** crates/domain/src/kind.rs:47:9: replace BeadKind::label -> String with "xyzzy".into()

*** mutation diff:
--- crates/domain/src/kind.rs
+++ replace BeadKind::label -> String with "xyzzy".into()
@@ -39,17 +39,17 @@
             Self::Incident => "incident",
             Self::Reference => "reference",
         }
     }
 
     /// The label string to attach to a bead.
     #[must_use]
     pub fn label(self) -> String {
-        format!("{}{}", Self::LABEL_PREFIX, self.as_str())
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Recover the kind from a bead's label list, if exactly one kind label is present.
     #[must_use]
     pub fn from_labels<'a, I: IntoIterator<Item = &'a str>>(labels: I) -> Option<Self> {
         let mut found = labels
             .into_iter()
             .filter_map(|l| l.strip_prefix(Self::LABEL_PREFIX))

---- kind::tests::label_roundtrip stdout ----

thread 'kind::tests::label_roundtrip' (2568499) panicked at crates/domain/src/kind.rs:108:13:
assertion `left == right` failed
  left: None
 right: Some(Epic)

failures:
    kind::tests::label_roundtrip

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
