*** crates/domain/src/kind.rs:53:9: replace BeadKind::from_labels -> Option<Self> with None

*** mutation diff:
--- crates/domain/src/kind.rs
+++ replace BeadKind::from_labels -> Option<Self> with None
@@ -45,24 +45,17 @@
     #[must_use]
     pub fn label(self) -> String {
         format!("{}{}", Self::LABEL_PREFIX, self.as_str())
     }
 
     /// Recover the kind from a bead's label list, if exactly one kind label is present.
     #[must_use]
     pub fn from_labels<'a, I: IntoIterator<Item = &'a str>>(labels: I) -> Option<Self> {
-        let mut found = labels
-            .into_iter()
-            .filter_map(|l| l.strip_prefix(Self::LABEL_PREFIX))
-            .filter_map(|k| k.parse().ok());
-        match (found.next(), found.next()) {
-            (Some(k), None) => Some(k),
-            (None, _) | (Some(_), Some(_)) => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Unknown kind string.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 #[error("unknown bead kind `{0}`")]
 pub struct UnknownKind(pub String);

---- kind::tests::label_roundtrip stdout ----

thread 'kind::tests::label_roundtrip' (2233763) panicked at crates/domain/src/kind.rs:101:13:
assertion `left == right` failed
  left: None
 right: Some(Epic)

failures:
    kind::tests::label_roundtrip

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
