*** crates/domain/src/kind.rs:88:9: replace <impl fmt::Display for BeadKind>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/domain/src/kind.rs
+++ replace <impl fmt::Display for BeadKind>::fmt -> fmt::Result with Ok(Default::default())
@@ -80,17 +80,17 @@
             "reference" => Ok(Self::Reference),
             other => Err(UnknownKind(other.to_owned())),
         }
     }
 }
 
 impl fmt::Display for BeadKind {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(self.as_str())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- kind::tests::display_matches_as_str stdout ----

thread 'kind::tests::display_matches_as_str' (2569402) panicked at crates/domain/src/kind.rs:114:9:
assertion `left == right` failed
  left: ""
 right: "verify"

failures:
    kind::tests::display_matches_as_str

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
