*** crates/domain/src/lease.rs:27:9: replace Lease::is_expired -> bool with false

*** mutation diff:
--- crates/domain/src/lease.rs
+++ replace Lease::is_expired -> bool with false
@@ -19,17 +19,17 @@
             holder,
             claimed_at: now,
             expires: now + ttl,
         }
     }
 
     #[must_use]
     pub fn is_expired(&self, now: Timestamp) -> bool {
-        now >= self.expires
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Extend the lease from `now` (not from the old expiry) so a stalled heartbeat
     /// cannot accumulate credit.
     #[must_use]
     pub fn renew(self, now: Timestamp, ttl: Duration) -> Self {
         Self {
             expires: now + ttl,

---- lease::tests::expires_at_boundary stdout ----

thread 'lease::tests::expires_at_boundary' (2571743) panicked at crates/domain/src/lease.rs:57:9:
assertion failed: l.is_expired(Timestamp::from_unix_seconds(10))

---- task::tests::heartbeat_after_expiry_is_rejected stdout ----

thread 'task::tests::heartbeat_after_expiry_is_rejected' (2571760) panicked at crates/domain/src/task_tests.rs:335:10:

---- task::tests::lease_expiry_updates_usage_and_counter stdout ----

thread 'task::tests::lease_expiry_updates_usage_and_counter' (2571765) panicked at crates/domain/src/task_tests.rs:171:61:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "leased", event: "lease_expired" }

failures:
    lease::tests::expires_at_boundary
    task::tests::heartbeat_after_expiry_is_rejected
    task::tests::lease_expiry_reopens_and_storms
    task::tests::lease_expiry_updates_usage_and_counter
    task::tests::lease_storm_incident_keeps_usage_and_counter

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
