*** crates/domain/src/lease.rs:35:13: delete field expires from struct Self expression in Lease::renew

*** mutation diff:
--- crates/domain/src/lease.rs
+++ delete field expires from struct Self expression in Lease::renew
@@ -27,17 +27,17 @@
         now >= self.expires
     }
 
     /// Extend the lease from `now` (not from the old expiry) so a stalled heartbeat
     /// cannot accumulate credit.
     #[must_use]
     pub fn renew(self, now: Timestamp, ttl: Duration) -> Self {
         Self {
-            expires: now + ttl,
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- lease::tests::renew_is_from_now stdout ----

thread 'lease::tests::renew_is_from_now' (2236107) panicked at crates/domain/src/lease.rs:68:9:
assertion `left == right` failed
  left: Timestamp(10)
 right: Timestamp(15)

failures:
    lease::tests::renew_is_from_now

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
