*** crates/domain/src/meta.rs:175:29: delete ! in <impl TryFrom<RawVerifyMeta> for VerifyMeta>::try_from

*** mutation diff:
--- crates/domain/src/meta.rs
+++ delete ! in <impl TryFrom<RawVerifyMeta> for VerifyMeta>::try_from
@@ -167,17 +167,17 @@
             return Err(VerifyMetaParseError::NoCommands);
         }
         Ok(Self {
             task: BeadId::try_new(raw.task)
                 .map_err(|e| VerifyMetaParseError::Task(e.to_string()))?,
             commands: raw
                 .commands
                 .into_iter()
-                .filter(|c| !c.trim().is_empty())
+                .filter(|c|  /* ~ changed by cargo-mutants ~ */c.trim().is_empty())
                 .collect(),
             timeout: raw.timeout,
         })
     }
 }
 
 impl From<VerifyMeta> for RawVerifyMeta {
     fn from(m: VerifyMeta) -> Self {

---- meta::tests::verify_meta_rejects_empty_commands stdout ----

thread 'meta::tests::verify_meta_rejects_empty_commands' (2284447) panicked at crates/domain/src/meta.rs:338:9:
assertion `left == right` failed: blank commands are dropped
  left: ["  ", ""]
 right: ["cargo test"]

failures:
    meta::tests::verify_meta_rejects_empty_commands

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
