*** crates/domain/src/meta.rs:233:24: replace != with == in <impl TryFrom<RawMergeMeta> for MergeMeta>::try_from

*** mutation diff:
--- crates/domain/src/meta.rs
+++ replace != with == in <impl TryFrom<RawMergeMeta> for MergeMeta>::try_from
@@ -225,17 +225,17 @@
     #[error("invalid head sha: {0}")]
     Head(String),
 }
 
 impl TryFrom<RawMergeMeta> for MergeMeta {
     type Error = MergeMetaParseError;
 
     fn try_from(raw: RawMergeMeta) -> Result<Self, Self::Error> {
-        if raw.version != META_VERSION {
+        if raw.version == /* ~ changed by cargo-mutants ~ */ META_VERSION {
             return Err(MergeMetaParseError::Version {
                 found: raw.version,
                 expected: META_VERSION,
             });
         }
         Ok(Self {
             task: BeadId::try_new(raw.task)
                 .map_err(|e| MergeMetaParseError::Task(e.to_string()))?,

---- meta::tests::merge_meta_roundtrip stdout ----

thread 'meta::tests::merge_meta_roundtrip' (2238746) panicked at crates/domain/src/meta.rs:347:89:
called `Result::unwrap()` on an `Err` value: Error("unsupported merge metadata version 1 (expected 1)", line: 0, column: 0)

failures:
    meta::tests::merge_meta_roundtrip

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
