*** crates/domain/src/meta.rs:272:9: replace BeadMeta::key -> &'static str with ""

*** mutation diff:
--- crates/domain/src/meta.rs
+++ replace BeadMeta::key -> &'static str with ""
@@ -264,21 +264,17 @@
     Verify(VerifyMeta),
     Merge(MergeMeta),
 }
 
 impl BeadMeta {
     /// The metadata key this variant is stored under.
     #[must_use]
     pub const fn key(&self) -> &'static str {
-        match self {
-            Self::Task(_) => META_KEY,
-            Self::Verify(_) => VERIFY_META_KEY,
-            Self::Merge(_) => MERGE_META_KEY,
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<Task> for FactoryMeta {
     fn from(t: Task) -> Self {
         Self {
             verify_bead: t.verify_bead,
             base: t.base,

---- meta::tests::bead_meta_keys_and_task_roundtrip stdout ----

thread 'meta::tests::bead_meta_keys_and_task_roundtrip' (2239283) panicked at crates/domain/src/meta.rs:389:9:
assertion `left == right` failed
  left: ""
 right: "fac"

failures:
    meta::tests::bead_meta_keys_and_task_roundtrip

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
