*** crates/domain/src/plan.rs:112:16: delete ! in RawPlan::validate

*** mutation diff:
--- crates/domain/src/plan.rs
+++ delete ! in RawPlan::validate
@@ -104,17 +104,17 @@
     pub fn validate(self, defaults: PlanDefaults) -> Result<Plan, PlanError> {
         if self.tasks.is_empty() {
             return Err(PlanError::Empty);
         }
         let mut seen = BTreeSet::new();
         let mut tasks = Vec::with_capacity(self.tasks.len());
         for raw in self.tasks {
             let key = parse_key(&raw.key)?;
-            if !seen.insert(key.clone()) {
+            if  /* ~ changed by cargo-mutants ~ */seen.insert(key.clone()) {
                 return Err(PlanError::DuplicateKey(raw.key));
             }
             if raw.title.trim().is_empty() {
                 return Err(PlanError::EmptyTitle(raw.key));
             }
             let verify: Vec<String> = raw
                 .verify
                 .into_iter()

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2287982) panicked at crates/domain/src/plan.rs:248:14:
called `Result::unwrap()` on an `Err` value: DuplicateKey("c")

---- plan::tests::blank_reference_is_none_and_keys_display stdout ----

thread 'plan::tests::blank_reference_is_none_and_keys_display' (2287981) panicked at crates/domain/src/plan.rs:257:53:
called `Result::unwrap()` on an `Err` value: DuplicateKey("a")

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2287983) panicked at crates/domain/src/plan.rs:278:9:
assertion failed: matches!(plan(vec![raw("a", &["b"]), raw("b", &["a"])]).validate(d),
    Err(PlanError::Cycle(_)))

failures:
    plan::tests::blank_reference_is_none_and_keys_display
    plan::tests::orders_needs_first
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
