*** crates/domain/src/plan.rs:146:54: delete ! in RawPlan::validate

*** mutation diff:
--- crates/domain/src/plan.rs
+++ delete ! in RawPlan::validate
@@ -138,17 +138,17 @@
                 acceptance: raw.acceptance,
                 verify,
                 needs,
                 budget: defaults.budget,
                 verify_timeout: defaults.verify_timeout,
             });
         }
         for t in &tasks {
-            if let Some(n) = t.needs.iter().find(|n| !seen.contains(*n)) {
+            if let Some(n) = t.needs.iter().find(|n|  /* ~ changed by cargo-mutants ~ */seen.contains(*n)) {
                 return Err(PlanError::UnknownNeed {
                     task: t.key.to_string(),
                     needs: n.to_string(),
                 });
             }
         }
         let tasks = topo_sort(tasks)?;
         Ok(Plan {

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2288529) panicked at crates/domain/src/plan.rs:248:14:
called `Result::unwrap()` on an `Err` value: UnknownNeed { task: "c", needs: "b" }

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2288530) panicked at crates/domain/src/plan.rs:278:9:
assertion failed: matches!(plan(vec![raw("a", &["b"]), raw("b", &["a"])]).validate(d),
    Err(PlanError::Cycle(_)))

failures:
    plan::tests::orders_needs_first
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
