*** crates/domain/src/plan.rs:183:48: replace || with && in parse_key

*** mutation diff:
--- crates/domain/src/plan.rs
+++ replace || with && in parse_key
@@ -175,17 +175,17 @@
     }
 }
 
 fn parse_key(s: &str) -> Result<TaskKey, PlanError> {
     let t = s.trim();
     if t.is_empty()
         || !t
             .chars()
-            .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+            .all(|c| c.is_ascii_alphanumeric() && /* ~ changed by cargo-mutants ~ */ c == '-' || c == '_')
     {
         return Err(PlanError::BadKey(s.to_owned()));
     }
     Ok(TaskKey(t.to_owned()))
 }
 
 /// Kahn's algorithm; stable with respect to input order among ready tasks.
 fn topo_sort(tasks: Vec<PlannedTask>) -> Result<Vec<PlannedTask>, PlanError> {

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2244085) panicked at crates/domain/src/plan.rs:248:14:
called `Result::unwrap()` on an `Err` value: BadKey("c")

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2244086) panicked at crates/domain/src/plan.rs:256:9:
assertion failed: matches!(plan(vec![raw("a", &["b"]), raw("b", &["a"])]).validate(d),
    Err(PlanError::Cycle(_)))

failures:
    plan::tests::orders_needs_first
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
