*** crates/domain/src/plan.rs:198:11: delete ! in topo_sort

*** mutation diff:
--- crates/domain/src/plan.rs
+++ delete ! in topo_sort
@@ -190,17 +190,17 @@
 /// Kahn's algorithm; stable with respect to input order among ready tasks.
 fn topo_sort(tasks: Vec<PlannedTask>) -> Result<Vec<PlannedTask>, PlanError> {
     let mut indegree: BTreeMap<TaskKey, usize> = tasks
         .iter()
         .map(|t| (t.key.clone(), t.needs.len()))
         .collect();
     let mut pending: Vec<PlannedTask> = tasks;
     let mut ordered = Vec::with_capacity(pending.len());
-    while !pending.is_empty() {
+    while  /* ~ changed by cargo-mutants ~ */pending.is_empty() {
         let Some(pos) = pending
             .iter()
             .position(|t| indegree.get(&t.key).copied() == Some(0))
         else {
             let stuck = pending
                 .first()
                 .map(|t| t.key.to_string())
                 .unwrap_or_default();

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2246239) panicked at crates/domain/src/plan.rs:250:9:
assertion `left == right` failed
  left: []
 right: ["a", "b", "c"]

---- plan::tests::rejects_cycle_dangling_dup_self_empty stdout ----

thread 'plan::tests::rejects_cycle_dangling_dup_self_empty' (2246240) panicked at crates/domain/src/plan.rs:256:9:
assertion failed: matches!(plan(vec![raw("a", &["b"]), raw("b", &["a"])]).validate(d),
    Err(PlanError::Cycle(_)))

failures:
    plan::tests::orders_needs_first
    plan::tests::rejects_cycle_dangling_dup_self_empty

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
