*** crates/domain/src/plan.rs:201:57: replace == with != in topo_sort

*** mutation diff:
--- crates/domain/src/plan.rs
+++ replace == with != in topo_sort
@@ -193,17 +193,17 @@
         .iter()
         .map(|t| (t.key.clone(), t.needs.len()))
         .collect();
     let mut pending: Vec<PlannedTask> = tasks;
     let mut ordered = Vec::with_capacity(pending.len());
     while !pending.is_empty() {
         let Some(pos) = pending
             .iter()
-            .position(|t| indegree.get(&t.key).copied() == Some(0))
+            .position(|t| indegree.get(&t.key).copied() != /* ~ changed by cargo-mutants ~ */ Some(0))
         else {
             let stuck = pending
                 .first()
                 .map(|t| t.key.to_string())
                 .unwrap_or_default();
             return Err(PlanError::Cycle(stuck));
         };
         let done = pending.remove(pos);

---- plan::tests::orders_needs_first stdout ----

thread 'plan::tests::orders_needs_first' (2246110) panicked at crates/domain/src/plan.rs:248:14:
called `Result::unwrap()` on an `Err` value: Cycle("a")

failures:
    plan::tests::orders_needs_first

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
