*** crates/domain/src/task.rs:199:9: replace Event::name -> &'static str with ""

*** mutation diff:
--- crates/domain/src/task.rs
+++ replace Event::name -> &'static str with ""
@@ -191,28 +191,17 @@
             }
         }
     }
 }
 
 impl Event {
     #[must_use]
     pub const fn name(&self) -> &'static str {
-        match self {
-            Self::Claim { .. } => "claim",
-            Self::Heartbeat { .. } => "heartbeat",
-            Self::Submit { .. } => "submit",
-            Self::LeaseExpired { .. } => "lease_expired",
-            Self::Release { .. } => "release",
-            Self::VerifyPassed => "verify_passed",
-            Self::VerifyFailed { .. } => "verify_failed",
-            Self::Merged { .. } => "merged",
-            Self::MergeFailed { .. } => "merge_failed",
-            Self::Escalate { .. } => "escalate",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Task {
     /// A fresh task in `Open` with default budget and no usage.
     #[must_use]
     pub fn new(id: BeadId, verify_bead: BeadId, base: Sha, budget: Budget) -> Self {
         Self {

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2294754) panicked at crates/domain/src/task_tests.rs:227:5:
assertion failed: matches!(err, IllegalTransition::NotAllowed
    { state: "leased", event: "lease_expired", .. })

failures:
    task::tests::lease_expiry_before_expiry_is_illegal

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
