*** crates/domain/src/task.rs:249:21: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -241,19 +241,17 @@
             state: state.name(),
             event: event.name(),
         };
 
         match (self.state.clone(), event) {
             // ---- open -----------------------------------------------------------------
             (TaskState::Open, Event::Claim { holder, now, ttl }) => Ok(Transition {
                 task: Task {
-                    state: TaskState::Leased {
-                        lease: Lease::grant(holder, now, ttl),
-                    },
+                     /* ~ changed by cargo-mutants ~ */
                     ..self
                 },
                 effects: vec![],
             }),
 
             // ---- leased ---------------------------------------------------------------
             (TaskState::Leased { lease }, Event::Heartbeat { holder, now }) => {
                 Self::require_holder(&self.id, &lease, &holder)?;

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2296083) panicked at crates/domain/src/task_tests.rs:54:5:
assertion `left == right` failed
  left: "open"
 right: "leased"

---- task::tests::escalate_from_any_active_state stdout ----

thread 'task::tests::escalate_from_any_active_state' (2296082) panicked at crates/domain/src/task_tests.rs:410:45:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "open", event: "submit" }

---- task::tests::lease_expiry_before_expiry_is_illegal stdout ----

thread 'task::tests::lease_expiry_before_expiry_is_illegal' (2296086) panicked at crates/domain/src/task_tests.rs:227:5:
assertion failed: matches!(err, IllegalTransition::NotAllowed
    { state: "leased", event: "lease_expired", .. })

failures:
    task::tests::escalate_from_any_active_state
    task::tests::happy_path
    task::tests::heartbeat_after_expiry_is_rejected
    task::tests::illegal_pairs_in_active_states
    task::tests::lease_expiry_before_expiry_is_illegal
    task::tests::lease_expiry_reopens_and_storms
    task::tests::lease_expiry_updates_usage_and_counter
    task::tests::merge_failure_reopens_with_note
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::terminal_flags_and_state_names
    task::tests::verify_failure_and_merge_failure_accumulate_usage
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 26 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
