*** crates/domain/src/task.rs:295:25: delete field state from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::apply
@@ -287,17 +287,17 @@
                 Self::require_holder(&self.id, &lease, &holder)?;
                 let usage = self
                     .usage
                     .add_tokens(tokens)
                     .add_wall_clock(now.since(lease.claimed_at));
                 Ok(Transition {
                     task: Task {
                         usage,
-                        state: TaskState::InVerify { branch, head },
+                         /* ~ changed by cargo-mutants ~ */
                         ..self
                     },
                     effects: vec![],
                 })
             }
             (TaskState::Leased { lease }, Event::LeaseExpired { now }) => {
                 if !lease.is_expired(now) {
                     return Err(illegal(&self.state, &Event::LeaseExpired { now }));

---- task::tests::escalate_from_any_active_state stdout ----

thread 'task::tests::escalate_from_any_active_state' (2297379) panicked at crates/domain/src/task_tests.rs:415:58:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "leased", event: "verify_passed" }

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2297382) panicked at crates/domain/src/task_tests.rs:63:5:
assertion `left == right` failed
  left: "leased"
 right: "in_verify"

---- task::tests::illegal_pairs_in_active_states stdout ----

thread 'task::tests::illegal_pairs_in_active_states' (2297384) panicked at crates/domain/src/task_tests.rs:383:58:
called `Result::unwrap()` on an `Err` value: NotAllowed { id: BeadId("fac-1"), state: "leased", event: "verify_passed" }

failures:
    task::tests::escalate_from_any_active_state
    task::tests::happy_path
    task::tests::illegal_pairs_in_active_states
    task::tests::merge_failure_reopens_with_note
    task::tests::verify_failure_and_merge_failure_accumulate_usage
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
