*** crates/domain/src/task.rs:322:25: delete field usage from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field usage from struct Task expression in Task::apply
@@ -314,17 +314,17 @@
                         usage,
                         lease_expiries: expiries,
                         ..self
                     };
                     return Ok(t.escalate(IncidentReason::LeaseStorm { expiries }));
                 }
                 Ok(Transition {
                     task: Task {
-                        usage,
+                         /* ~ changed by cargo-mutants ~ */
                         lease_expiries: expiries,
                         state: TaskState::Open,
                         ..self
                     },
                     effects: vec![Effect::AppendNote { task: id, note }],
                 })
             }

---- task::tests::lease_expiry_updates_usage_and_counter stdout ----

thread 'task::tests::lease_expiry_updates_usage_and_counter' (2299695) panicked at crates/domain/src/task_tests.rs:172:5:
assertion `left == right` failed
  left: Duration(0)
 right: Duration(90)

failures:
    task::tests::lease_expiry_updates_usage_and_counter

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
