*** crates/domain/src/task.rs:323:25: delete field lease_expiries from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field lease_expiries from struct Task expression in Task::apply
@@ -315,17 +315,17 @@
                         lease_expiries: expiries,
                         ..self
                     };
                     return Ok(t.escalate(IncidentReason::LeaseStorm { expiries }));
                 }
                 Ok(Transition {
                     task: Task {
                         usage,
-                        lease_expiries: expiries,
+                         /* ~ changed by cargo-mutants ~ */
                         state: TaskState::Open,
                         ..self
                     },
                     effects: vec![Effect::AppendNote { task: id, note }],
                 })
             }
 
             // ---- in_verify ------------------------------------------------------------

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2253551) panicked at crates/domain/src/task_tests.rs:140:5:
assertion failed: matches!(tr.task.state, TaskState::Incident
    { reason: IncidentReason::LeaseStorm { expiries: MAX_LEASE_EXPIRIES } })

failures:
    task::tests::lease_expiry_reopens_and_storms

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
