*** crates/domain/src/task.rs:348:32: delete field usage from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field usage from struct Task expression in Task::apply
@@ -340,17 +340,17 @@
                 effects: vec![Effect::OpenMergeBead {
                     task: id,
                     branch,
                     head,
                 }],
             }),
             (TaskState::InVerify { .. }, Event::VerifyFailed { note }) => {
                 let usage = self.usage.add_attempt();
-                let t = Task { usage, ..self };
+                let t = Task {  /* ~ changed by cargo-mutants ~ */ ..self };
                 match t.budget.check(usage) {
                     Ok(()) => Ok(Transition {
                         task: Task {
                             state: TaskState::Open,
                             ..t
                         },
                         effects: vec![Effect::AppendNote { task: id, note }],
                     }),

---- task::tests::verify_failure_reopens_then_escalates stdout ----

thread 'task::tests::verify_failure_reopens_then_escalates' (2253723) panicked at crates/domain/src/task_tests.rs:96:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
