*** crates/domain/src/task.rs:403:32: delete field usage from struct Task expression in Task::apply

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field usage from struct Task expression in Task::apply
@@ -395,17 +395,17 @@
             }
 
             (TaskState::Leased { lease }, Event::Release { holder, now, note }) => {
                 Self::require_holder(&self.id, &lease, &holder)?;
                 let usage = self
                     .usage
                     .add_wall_clock(now.since(lease.claimed_at))
                     .add_attempt();
-                let t = Task { usage, ..self };
+                let t = Task {  /* ~ changed by cargo-mutants ~ */ ..self };
                 match t.budget.check(usage) {
                     Ok(()) => Ok(Transition {
                         task: Task {
                             state: TaskState::Open,
                             ..t
                         },
                         effects: vec![Effect::AppendNote { task: id, note }],
                     }),

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2304082) panicked at crates/domain/src/task_tests.rs:247:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    task::tests::release_reopens_and_counts_attempt_then_escalates

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
