*** crates/domain/src/task.rs:489:17: delete field state from struct Task expression in Task::escalate

*** mutation diff:
--- crates/domain/src/task.rs
+++ delete field state from struct Task expression in Task::escalate
@@ -481,19 +481,17 @@
             ) => Err(illegal(&state, &event)),
         }
     }
 
     fn escalate(self, reason: IncidentReason) -> Transition {
         let id = self.id.clone();
         Transition {
             task: Task {
-                state: TaskState::Incident {
-                    reason: reason.clone(),
-                },
+                 /* ~ changed by cargo-mutants ~ */
                 ..self
             },
             effects: vec![Effect::OpenIncidentBead { task: id, reason }],
         }
     }
 
     fn require_holder(
         id: &BeadId,

---- task::tests::escalate_from_any_active_state stdout ----

thread 'task::tests::escalate_from_any_active_state' (2304178) panicked at crates/domain/src/task_tests.rs:401:5:
assertion failed: matches!(open.clone().apply(e()).unwrap().task.state, TaskState::Incident
    { .. })

---- task::tests::lease_expiry_reopens_and_storms stdout ----

thread 'task::tests::lease_expiry_reopens_and_storms' (2304183) panicked at crates/domain/src/task_tests.rs:140:5:
assertion failed: matches!(tr.task.state, TaskState::Incident
    { reason: IncidentReason::LeaseStorm { expiries: MAX_LEASE_EXPIRIES } })

---- task::tests::release_reopens_and_counts_attempt_then_escalates stdout ----

thread 'task::tests::release_reopens_and_counts_attempt_then_escalates' (2304186) panicked at crates/domain/src/task_tests.rs:256:5:
attempts budget was 2

failures:
    task::tests::escalate_from_any_active_state
    task::tests::lease_expiry_reopens_and_storms
    task::tests::release_reopens_and_counts_attempt_then_escalates
    task::tests::verify_failure_reopens_then_escalates

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
