*** crates/domain/src/time.rs:20:9: replace Timestamp::unix_seconds -> i64 with -1

*** mutation diff:
--- crates/domain/src/time.rs
+++ replace Timestamp::unix_seconds -> i64 with -1
@@ -12,17 +12,17 @@
 impl Timestamp {
     #[must_use]
     pub const fn from_unix_seconds(secs: i64) -> Self {
         Self(secs)
     }
 
     #[must_use]
     pub const fn unix_seconds(self) -> i64 {
-        self.0
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Elapsed time from `earlier` to `self`; zero if `earlier` is later.
     #[must_use]
     pub fn since(self, earlier: Self) -> Duration {
         Duration::from_seconds(u64::try_from(self.0.saturating_sub(earlier.0)).unwrap_or(0))
     }
 }

*** result: Success
