*** crates/domain/src/time.rs:55:9: replace Duration::seconds -> u64 with 1

*** mutation diff:
--- crates/domain/src/time.rs
+++ replace Duration::seconds -> u64 with 1
@@ -47,17 +47,17 @@
 
     #[must_use]
     pub const fn from_minutes(mins: u64) -> Self {
         Self(mins.saturating_mul(60))
     }
 
     #[must_use]
     pub const fn seconds(self) -> u64 {
-        self.0
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Add<Duration> for Timestamp {
     type Output = Self;
 
     fn add(self, rhs: Duration) -> Self {
         let secs = i64::try_from(rhs.0).unwrap_or(i64::MAX);

---- budget::tests::limits_are_inclusive_for_tokens_and_wall_clock stdout ----

thread 'budget::tests::limits_are_inclusive_for_tokens_and_wall_clock' (2619232) panicked at crates/domain/src/budget.rs:153:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(WallClock { used: 11, limit: 10 })

---- task::tests::lease_expiry_updates_usage_and_counter stdout ----

thread 'task::tests::lease_expiry_updates_usage_and_counter' (2619265) panicked at crates/domain/src/task_tests.rs:173:5:
assertion `left == right` failed
  left: Duration(2)
 right: Duration(90)

---- task::tests::happy_path stdout ----

thread 'task::tests::happy_path' (2619259) panicked at crates/domain/src/task_tests.rs:66:5:
assertion `left == right` failed
  left: Duration(2)
 right: Duration(50)

failures:
    budget::tests::limits_are_inclusive_for_tokens_and_wall_clock
    task::tests::happy_path
    task::tests::lease_expiry_updates_usage_and_counter
    task::tests::lease_storm_incident_keeps_usage_and_counter
    task::tests::verify_failure_and_merge_failure_accumulate_usage

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
